#  Pandas Index 조작

In [12]:
import pandas as pd
import numpy as np

##  데이터프레임 인덱스 설정 및 제거

- set_index : 기존의 행 인덱스를 제거하고 데이터 열 중 하나를 인덱스로 설정
- reset_index : 기존의 행 인덱스를 제거하고 인덱스를 마지막 데이터 열로 추가

In [11]:
np.random.seed(0)
index_reset_test = pd.DataFrame(np.random.randint(1,10,(10,4)),
                                columns = ['col1','col2','col3','col4'])
index_reset_test

   col1  col2  col3  col4
0     6     1     4     4
1     8     4     6     3
2     5     8     7     9
3     9     2     7     8
4     8     9     2     6
5     9     5     4     1
6     4     6     1     3
7     4     9     2     4
8     4     4     8     1
9     2     1     5     8

In [8]:
index_reset_test_01 = index_reset_test.set_index('col1')

In [9]:
index_reset_test_01

      col2  col3  col4
col1
6        1     4     4
8        4     6     3
5        8     7     9
9        2     7     8
8        9     2     6
9        5     4     1
4        6     1     3
4        9     2     4
4        4     8     1
2        1     5     8

In [10]:
index_reset_test_02  = index_reset_test_01.set_index('col2')

In [11]:
index_reset_test_02

      col3  col4
col2
1        4     4
4        6     3
8        7     9
2        7     8
9        2     6
5        4     1
6        1     3
9        2     4
4        8     1
1        5     8

In [12]:
index_reset_test_02.reset_index()

   col2  col3  col4
0     1     4     4
1     4     6     3
2     8     7     9
3     2     7     8
4     9     2     6
5     5     4     1
6     6     1     3
7     9     2     4
8     4     8     1
9     1     5     8

In [13]:
df_score=pd.read_csv('score.csv')

In [48]:
df_score

    이름  국어  영어  수학
0  김나라  84  34  45
1  이나라  65  23  83
2  최나라  86  45  42
3  국나라  78  46  46
4  하나라  65  45  45

In [17]:
df_score['이름']

0    김나라
1    이나라
2    최나라
3    국나라
4    하나라
Name: 이름, dtype: object

In [16]:
df_score.set_index('이름')

     국어  영어  수학
이름
김나라  84  34  45
이나라  65  23  83
최나라  86  45  42
국나라  78  46  46
하나라  65  45  45

In [17]:
df_score.index

RangeIndex(start=0, stop=5, step=1)

In [20]:
df_score_test = df_score.set_index('이름')

In [21]:
df_score_test.index

Index(['김나라', '이나라', '최나라', '국나라', '하나라'], dtype='object', name='이름')

In [22]:
df_score_test.reset_index()

    이름  국어  영어  수학
0  김나라  84  34  45
1  이나라  65  23  83
2  최나라  86  45  42
3  국나라  78  46  46
4  하나라  65  45  45

## 다중 인덱스

In [21]:
np.random.seed(0)
multiple_index_test_01 = pd.DataFrame(np.random.randint(1,10,(10,4)),
                                     columns = [['A','A','B','B'],['col1','col2','col3','col4']])

In [22]:
multiple_index_test_01

     A         B
  col1 col2 col3 col4
0    6    1    4    4
1    8    4    6    3
2    5    8    7    9
3    9    2    7    8
4    8    9    2    6
5    9    5    4    1
6    4    6    1    3
7    4    9    2    4
8    4    4    8    1
9    2    1    5    8

In [27]:
multiple_index_test_01.index.names = ['번호']
multiple_index_test_01

      A         B
   col1 col2 col3 col4
번호
0     6    1    4    4
1     8    4    6    3
2     5    8    7    9
3     9    2    7    8
4     8    9    2    6
5     9    5    4    1
6     4    6    1    3
7     4    9    2    4
8     4    4    8    1
9     2    1    5    8

In [28]:
multiple_index_test_01.columns.names = ['alphabet','number']
multiple_index_test_01

alphabet    A         B
number   col1 col2 col3 col4
번호
0           6    1    4    4
1           8    4    6    3
2           5    8    7    9
3           9    2    7    8
4           8    9    2    6
5           9    5    4    1
6           4    6    1    3
7           4    9    2    4
8           4    4    8    1
9           2    1    5    8

In [41]:
["ID" + str(i) for i in range(4)]*2

['ID0', 'ID1', 'ID2', 'ID3', 'ID0', 'ID1', 'ID2', 'ID3']

** [Quiz] ** 다음에서 [2,4] 가 결과물로 출력되는 input은 무엇일까요?
1. ['1','2'] * 2
2. [1,2] * 2
3. list([1,2]) * 2
4. pandas.Series([1,2]) * 2
5. numpy.array([1,2]) * 2

In [37]:
# 리스트에 대한 연산?
['1','2']*2

list

In [38]:
# 리스트에 대한 연산?
list([1,2])*2

[1, 2, 1, 2]

In [39]:
# Pandas 시리즈에 대한 연산?
pd.Series([1,2])*2

0    2
1    4
dtype: int64

In [36]:
# Numpy 배열에 대한 연산?
np.array([1,2])*2

array([2, 4])

In [30]:
np.random.seed(0)
multiple_test= pd.DataFrame(np.random.randint(1, 10, (8, 4)), 
                  columns=[["A", "A", "B", "B"], ["C", "D", "C", "D"]],
                  index=[["M", "M", "M", "M", "F", "F", "F", "F"], ["ID" + str(i) for i in range(4)] * 2])
multiple_test.columns.names = ["Col1", "Col2"]
multiple_test.index.names = ["Row1", "Row2"]
multiple_test

Col1       A     B
Col2       C  D  C  D
Row1 Row2
M    ID0   6  1  4  4
     ID1   8  4  6  3
     ID2   5  8  7  9
     ID3   9  2  7  8
F    ID0   8  9  2  6
     ID1   9  5  4  1
     ID2   4  6  1  3
     ID3   4  9  2  4

## 행 인덱스와 열 인덱스 교환

- stack(): 열(column) 인덱스를 행(row) 인덱스로 변환
- unstack(): 행(row) 인덱스를 열(column) 인덱스로 변환

In [31]:
# 스트링(텍스트) 값 사용하여 교환하기
multiple_test.stack('Col1')

Col2            C  D
Row1 Row2 Col1
M    ID0  A     6  1
          B     4  4
     ID1  A     8  4
          B     6  3
     ID2  A     5  8
          B     7  9
     ID3  A     9  2
          B     7  8
F    ID0  A     8  9
          B     2  6
     ID1  A     9  5
          B     4  1
     ID2  A     4  6
          B     1  3
     ID3  A     4  9
          B     2  4

In [32]:
# 정수값 사용하여 교환하기
multiple_test.stack(0)

Col2            C  D
Row1 Row2 Col1
M    ID0  A     6  1
          B     4  4
     ID1  A     8  4
          B     6  3
     ID2  A     5  8
          B     7  9
     ID3  A     9  2
          B     7  8
F    ID0  A     8  9
          B     2  6
     ID1  A     9  5
          B     4  1
     ID2  A     4  6
          B     1  3
     ID3  A     4  9
          B     2  4

In [33]:
# 스트링(텍스트) 값 사용하여 교환하기
multiple_test.unstack('Row2')

Col1   A                               B
Col2   C               D               C               D
Row2 ID0 ID1 ID2 ID3 ID0 ID1 ID2 ID3 ID0 ID1 ID2 ID3 ID0 ID1 ID2 ID3
Row1
F      8   9   4   4   9   5   6   9   2   4   1   2   6   1   3   4
M      6   8   5   9   1   4   8   2   4   6   7   7   4   3   9   8

In [34]:
# 정수값 사용하여 교환하기
multiple_test.unstack(1)

Col1   A                               B
Col2   C               D               C               D
Row2 ID0 ID1 ID2 ID3 ID0 ID1 ID2 ID3 ID0 ID1 ID2 ID3 ID0 ID1 ID2 ID3
Row1
F      8   9   4   4   9   5   6   9   2   4   1   2   6   1   3   4
M      6   8   5   9   1   4   8   2   4   6   7   7   4   3   9   8

## 인덱싱 하기

In [35]:
multiple_test

Col1       A     B
Col2       C  D  C  D
Row1 Row2
M    ID0   6  1  4  4
     ID1   8  4  6  3
     ID2   5  8  7  9
     ID3   9  2  7  8
F    ID0   8  9  2  6
     ID1   9  5  4  1
     ID2   4  6  1  3
     ID3   4  9  2  4

In [36]:
multiple_test[('A','C')]

Row1  Row2
M     ID0     6
      ID1     8
      ID2     5
      ID3     9
F     ID0     8
      ID1     9
      ID2     4
      ID3     4
Name: (A, C), dtype: int32

In [37]:
multiple_test.loc[('M','ID1'),:]

Col1  Col2
A     C       8
      D       4
B     C       6
      D       3
Name: (M, ID1), dtype: int32

In [38]:
multiple_index_test_01

alphabet    A         B
number   col1 col2 col3 col4
번호
0           6    1    4    4
1           8    4    6    3
2           5    8    7    9
3           9    2    7    8
4           8    9    2    6
5           9    5    4    1
6           4    6    1    3
7           4    9    2    4
8           4    4    8    1
9           2    1    5    8

In [85]:
multiple_index_test_01.loc[2,('A','col1')]

5

## 다중 인덱스 순서 교환하기

In [44]:
multiple_test

Col1       A     B
Col2       C  D  C  D
Row1 Row2
M    ID0   6  1  4  4
     ID1   8  4  6  3
     ID2   5  8  7  9
     ID3   9  2  7  8
F    ID0   8  9  2  6
     ID1   9  5  4  1
     ID2   4  6  1  3
     ID3   4  9  2  4

In [45]:
multiple_test.swaplevel('Row1','Row2')

Col1       A     B
Col2       C  D  C  D
Row2 Row1
ID0  M     6  1  4  4
ID1  M     8  4  6  3
ID2  M     5  8  7  9
ID3  M     9  2  7  8
ID0  F     8  9  2  6
ID1  F     9  5  4  1
ID2  F     4  6  1  3
ID3  F     4  9  2  4

In [47]:
multiple_test.swaplevel('Col1','Col2',1)

Col2       C  D  C  D
Col1       A  A  B  B
Row1 Row2
M    ID0   6  1  4  4
     ID1   8  4  6  3
     ID2   5  8  7  9
     ID3   9  2  7  8
F    ID0   8  9  2  6
     ID1   9  5  4  1
     ID2   4  6  1  3
     ID3   4  9  2  4

In [49]:
df_score

    이름  국어  영어  수학
0  김나라  84  34  45
1  이나라  65  23  83
2  최나라  86  45  42
3  국나라  78  46  46
4  하나라  65  45  45

In [50]:
df_score.set_index('이름')

     국어  영어  수학
이름
김나라  84  34  45
이나라  65  23  83
최나라  86  45  42
국나라  78  46  46
하나라  65  45  45

In [56]:
# 갯수
len(df_score)

5

In [57]:
# 평균 구하기
np.mean(df_score)

국어    75.6
영어    38.6
수학    52.2
dtype: float64

In [59]:
# 분산 구하기
np.var(df_score)

국어     81.84
영어     80.24
수학    238.96
dtype: float64

In [61]:
# 표준편차 구하기
np.std(df_score)

국어     9.046546
영어     8.957678
수학    15.458331
dtype: float64

In [65]:
# describe 메소드 사용하기
df_score.describe()

              국어         영어        수학
count   5.000000   5.000000   5.00000
mean   75.600000  38.600000  52.20000
std    10.114346  10.014989  17.28294
min    65.000000  23.000000  42.00000
25%    65.000000  34.000000  45.00000
50%    78.000000  45.000000  45.00000
75%    84.000000  45.000000  46.00000
max    86.000000  46.000000  83.00000